app/views/dashboard/index.html.erb

          </div>
          <h3 class="fw-bold" style="color: var(--primary-purple);"><%= DanceClass.count %></h3>
---
SELECT COUNT(*) FROM "dance_classes"

          </div>
          <h3 class="fw-bold" style="color: var(--gold);"><%= Figure.count %></h3>
---
SELECT COUNT(*) FROM "figures"

        <div class="card-body">
          <% recent_classes = DanceClass.includes(:dance_style, :dance_level, :instructor).limit(5) %>
---
SELECT "dance_styles".* FROM "dance_styles"
SELECT "dance_classes".* FROM "dance_classes" LIMIT $1  [["LIMIT", 5]]

          <div class="row">
            <% DanceStyle.all.group_by(&:category).each_with_index do |(category, styles), index| %>
---
SELECT "dance_styles".* FROM "dance_styles"

  <!-- Welcome Message for Empty State -->
  <% if DanceClass.count == 0 && Figure.count <= 4 %>
---
SELECT COUNT(*) FROM "dance_classes"
SELECT COUNT(*) FROM "figures"