app/views/figures/edit.html.erb

                <%= form.label :dance_style_id, "Dance Style *", class: "form-label fw-medium" %>
                <%= form.select :dance_style_id,
                    options_from_collection_for_select(@dance_styles, :id, :name, @figure.dance_style_id),
                    { prompt: "Select Dance Style" },
                    { class: "form-select #{'is-invalid' if @figure.errors[:dance_style_id].any?}", required: true } %>
---
SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC

                      <span class="fw-medium">
                        <% progress_count = @figure.student_progresses.count %>
---
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1  [["figure_id", 1]]

              <p class="text-muted small mb-0">
                This action cannot be undone. All student progress for this figure will be lost.
                <% if @figure.student_progresses.any? %>
                  <strong class="text-warning">
                    Warning: <%= @figure.student_progresses.count %> students have progress on this figure.
                  </strong>
---
SELECT 1 AS one FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1 LIMIT $2  [["figure_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1  [["figure_id", 1]]