app/views/figures/index.html.erb

            <div>
              <h5 class="card-title mb-0"><%= DanceStyle.count %></h5>
---
SELECT COUNT(*) FROM "dance_styles"

                      <td>
                        <% progress_count = figure.student_progresses.count %>
---
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1  [["figure_id", 1]]