app/views/figures/new.html.erb

SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC
---
                <%= form.label :dance_style_id, "Dance Style *", class: "form-label fw-medium" %>
                <%= form.select :dance_style_id,
                    options_from_collection_for_select(@form_data[:dance_styles], :id, :name, @figure.dance_style_id),
                    { prompt: "Select Dance Style" },
                    { class: "form-select #{'is-invalid' if @figure.errors[:dance_style_id].any?}", required: true } %>