app/views/figures/show.html.erb

              <p class="mb-0">
                <% progress_count = @figure.student_progresses.count %>
---
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1 ORDER BY "student_progresses"."updated_at" DESC  [["figure_id", 4]]
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1  [["figure_id", 4]]

        <div class="card-body">
          <% related_figures = Figure.where(dance_style: @figure.dance_style, dance_level: @figure.dance_level)
                                     .where.not(id: @figure.id)
                                     .by_number.limit(5) %>
---
SELECT "figures".* FROM "figures" WHERE "figures"."dance_style_id" = $1 AND "figures"."dance_level_id" = $2 AND "figures"."id" != $3 ORDER BY