app/views/student_progress/all_students.html.erb

SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 AND "student_progresses"."updated_at" IS NOT NULL ORDER BY "student_progresses"."updated_at" DESC LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
---
                      <td>
                        <% last_progress = user.student_progresses.where.not(updated_at: nil).order(updated_at: :desc).first %>