app/views/student_progress/enroll.html.erb

                <span class="badge bg-primary">
                  <%= @user.student_progresses.count %> figures
---
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."user_id" = $1  [["user_id", 4]]

                <%= form.label :dance_style_id, "Dance Style", class: "form-label fw-medium" %>
                <%= form.select :dance_style_id,
                    options_from_collection_for_select(@enrollment_form_data[:dance_styles], :id, :name),
                    { prompt: "Choose a dance style..." },
                    { class: "form-select", required: true, id: "dance_style_select" } %>
---
SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC

        <div class="card-body">
          <% current_enrollments = @user.student_progresses.joins(figure: [:dance_style, :dance_level])
                                           .group('dance_styles.name, dance_levels.name')
                                           .count %>
---
SELECT COUNT(*) AS "count_all", dance_styles.name, dance_levels.name AS "dance_styles_name_dance_levels_name" FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1 GROUP BY dance_styles.name, dance_levels.name  [["user_id", 4]]