app/views/student_progress/index.html.erb

  <!-- Quick Dance Style Navigation -->
  <% if @progress_data[:available_dance_styles].any? %>
---
SELECT "dance_styles".* FROM "dance_styles"

              <% @progress_data[:progresses_by_style].each do |dance_style, progresses| %>
                <% progresses.group_by { |sp| sp.figure.dance_level }.each do |level, level_progresses| %>
---
SELECT "figures".* FROM "figures" WHERE "figures"."id" IN ($1, $2, $3, $4)  [["id", 1], ["id", 4], ["id", 2], ["id", 3]]

                              <strong><%= progress.figure.name %></strong>
                              <% if progress.figure.components.present? %>
---
SELECT 1 AS one FROM "figures" LIMIT $1  [["LIMIT", 1]]

              Showing <%= (@progress_data[:student_progresses_paginated].current_page - 1) * @progress_data[:student_progresses_paginated].limit_value + 1 %>
              to <%= [@progress_data[:student_progresses_paginated].current_page * @progress_data[:student_progresses_paginated].limit_value, @progress_data[:stats][:total_figures]].min %>
---
SELECT "figures".* FROM "figures" LIMIT $1  [["LIMIT", 5]]