app/views/student_progress/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <% if current_user.admin? || current_user.instructor? %>
              <% form_url = params[:user_id].present? ? user_student_progress_path(@student_progress.user, @student_progress) : student_progress_path(@student_progress) %>