app/controllers/dance_classes_controller.rb

  def index
    @dance_classes = DanceClass.includes(:dance_style, :dance_level, :instructor, :location)
                               .order(:name)

    # Add pagination if Kaminari is available
    if defined?(Kaminari)
      @dance_classes = @dance_classes.page(params[:page]).per(12)
---
SELECT "dance_classes".* FROM "dance_classes" WHERE "dance_classes"."dance_style_id" = $1 AND "dance_classes"."instructor_id" = $2 ORDER BY "dance_classes"."name" ASC LIMIT $3 OFFSET $4  [["dance_style_id", 1], ["instructor_id", 2], ["LIMIT", 12], ["OFFSET", 0]]
SELECT "dance_styles".* FROM "dance_styles"

  def new
    @dance_class = DanceClass.new
    @dance_styles = DanceStyle.all
    @dance_levels = DanceLevel.all
---
SELECT "dance_styles".* FROM "dance_styles"
SELECT "dance_levels".* FROM "dance_levels"

  def create
    @dance_class = DanceClass.new(dance_class_params)

    if @dance_class.save
---
INSERT INTO "dance_classes" ("name", "dance_style_id", "dance_level_id", "instructor_id", "location_id", "duration_minutes", "max_capacity", "price", "description", "class_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def set_dance_class
    @dance_class = DanceClass.find(params[:id])
---
SELECT "dance_classes".* FROM "dance_classes" WHERE "dance_classes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]