app/controllers/figures_controller.rb

  def index
    @figures = Figure.includes(:dance_style, :dance_level)

    # Filter by dance style
    if params[:dance_style_id].present?
      @figures = @figures.where(dance_style_id: params[:dance_style_id])
    end

    # Filter by dance level
    if params[:dance_level_id].present?
      @figures = @figures.where(dance_level_id: params[:dance_level_id])
    end

    # Filter by core/variation
    if params[:is_core].present?
      @figures = @figures.where(is_core: params[:is_core] == 'true')
    end

    # Search by name or figure number
    if params[:search].present?
      @figures = @figures.where(
        "name ILIKE ? OR figure_number ILIKE ?",
        "%#{params[:search]}%", "%#{params[:search]}%"
      )
    end

    @figures = @figures.by_number.page(params[:page]).per(20)

    # For filtering dropdowns
    @dance_styles = DanceStyle.order(:name)
    @dance_levels = DanceLevel.order(:level_number)

    # Statistics
    @total_figures = Figure.count
---
SELECT "dance_levels".* FROM "dance_levels" WHERE "dance_levels"."id" IN ($1, $2)  [["id", 1], ["id", 4]]
SELECT "dance_styles".* FROM "dance_styles" WHERE "dance_styles"."id" IN ($1, $2, $3)  [["id", 2], ["id", 1], ["id", 3]]
SELECT "figures".* FROM "figures" WHERE "figures"."dance_style_id" = $1 ORDER BY
SELECT "dance_levels".* FROM "dance_levels" WHERE "dance_levels"."id" = $1  [["id", 1]]
SELECT "dance_styles".* FROM "dance_styles" WHERE "dance_styles"."id" = $1  [["id", 1]]
SELECT COUNT(*) FROM "dance_styles"
SELECT COUNT(*) FROM "figures" WHERE "figures"."is_core" = $1  [["is_core", true]]
SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC
SELECT "dance_levels".* FROM "dance_levels" ORDER BY "dance_levels"."level_number" ASC
SELECT COUNT(*) FROM "figures"

  def show
    @student_progresses = @figure.student_progresses.includes(:user).recent
---
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."figure_id" = $1 ORDER BY "student_progresses"."updated_at" DESC  [["figure_id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

  def new
    @figure = Figure.new
    @dance_styles = DanceStyle.order(:name)
    @dance_levels = DanceLevel.order(:level_number)
---
SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC
SELECT "dance_levels".* FROM "dance_levels" ORDER BY "dance_levels"."level_number" ASC

  def edit
    @dance_styles = DanceStyle.order(:name)
    @dance_levels = DanceLevel.order(:level_number)
---
SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC
SELECT "dance_levels".* FROM "dance_levels" ORDER BY "dance_levels"."level_number" ASC

  def set_figure
    @figure = Figure.find(params[:id])
---
SELECT "figures".* FROM "figures" WHERE "figures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]