app/controllers/student_progress_controller.rb

SELECT "dance_levels".* FROM "dance_levels" ORDER BY "dance_levels"."level_number" ASC
SELECT 1 AS one FROM "figures" LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1  [["user_id", 4]]
SELECT "dance_styles".* FROM "dance_styles" WHERE "dance_styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @student_progresses = current_user.student_progresses.includes(:figure, :instructor)
                                     .joins(figure: [:dance_style, :dance_level])
                                     .order('dance_styles.name, dance_levels.level_number, figures.figure_number')

    # If no progress exists, create some sample progress for demonstration
    if @student_progresses.empty? && Figure.exists?
      create_sample_progress_for_user(current_user)
      @student_progresses = current_user.student_progresses.includes(:figure, :instructor)
                                       .joins(figure: [:dance_style, :dance_level])
                                       .order('dance_styles.name, dance_levels.level_number, figures.figure_number')
    end

    # Group by dance style for better organization
    @progresses_by_style = @student_progresses.group_by { |sp| sp.figure.dance_style }

    # Calculate overall statistics
    @total_figures = @student_progresses.count
    @completed_figures = @student_progresses.completed.count
    @overall_completion = @total_figures > 0 ? (@completed_figures.to_f / @total_figures * 100).round(1) : 0

    # Filter parameters
    @selected_style = params[:dance_style_id].present? ? DanceStyle.find(params[:dance_style_id]) : nil

UPDATE "student_progresses" SET "partnering_passed" = $1, "updated_at" = $2 WHERE "student_progresses"."id" = $3  [["partnering_passed", true], ["updated_at", "2025-07-28 02:57:02.883567"], ["id", 1]]
---
  def update
    # Handle mark_all parameter from JavaScript
    if params[:mark_all] == 'true'
      @student_progress.update!(
        movement_passed: true,
        timing_passed: true,
        partnering_passed: true
      )

SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 AND "student_progresses"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_student_progress
    @student_progress = current_user.student_progresses.find(params[:id])

SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 AND "student_progresses"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def set_student_progress
    @student_progress = current_user.student_progresses.find(params[:id])

SELECT "figures".* FROM "figures" LIMIT $1  [["LIMIT", 5]]
INSERT INTO "student_progresses" ("user_id", "figure_id", "movement_passed", "timing_passed", "partnering_passed", "completed_at", "instructor_id", "created_at", "updated_at", "notes") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create_sample_progress_for_user(user)
    # Ensure we have an instructor
    instructor = User.instructors.first

    if instructor.nil?
      # Create a demo instructor if none exists
      instructor = User.create!(
        first_name: "Demo",
        last_name: "Instructor",
        email: "demo.instructor@example.com",
        password: "password123",
        password_confirmation: "password123",
        role: "instructor",
        membership_type: "none",
        waiver_signed: true,
        waiver_signed_at: Time.current
      )
    end

    # Create sample progress for the first few figures if they exist
    Figure.limit(5).each do |figure|
      user.student_progresses.create!(
        figure: figure,
        instructor: instructor,
        movement_passed: [true, false].sample,
        timing_passed: [true, false].sample,
        partnering_passed: [true, false].sample,
        notes: "Sample progress notes for #{figure.name}"
      )