app/controllers/student_progress_controller.rb

  def set_user
    @user = params[:user_id].present? ? User.find(params[:user_id]) : current_user
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 2]]