app/controllers/student_progress_controller.rb

  def index
    # Determine which user's progress to show
    if params[:user_id].present?
      # Admin/instructor viewing specific user's progress
      authorize_instructor_access!
      @viewing_user = User.find(params[:user_id])
      @student_progresses = @viewing_user.student_progresses.includes(:figure, :instructor)
                                         .joins(figure: [:dance_style, :dance_level])
                                         .order('dance_styles.name, dance_levels.level_number, figures.figure_number')
    else
      # User viewing their own progress
      @viewing_user = current_user
      @student_progresses = current_user.student_progresses.includes(:figure, :instructor)
                                       .joins(figure: [:dance_style, :dance_level])
                                       .order('dance_styles.name, dance_levels.level_number, figures.figure_number')
    end

    # Get all available dance styles for the filter dropdown
    @available_dance_styles = DanceStyle.joins(:figures)
                                       .joins("JOIN student_progresses sp ON sp.figure_id = figures.id")
                                       .where("sp.user_id = ?", @viewing_user.id)
                                       .distinct
                                       .order(:name)

    # Filter by dance style if selected
    @selected_style = params[:dance_style_id].present? ? DanceStyle.find(params[:dance_style_id]) : nil
    @selected_level = params[:dance_level_id].present? ? DanceLevel.find(params[:dance_level_id]) : nil
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT DISTINCT "dance_styles".* FROM "dance_styles" INNER JOIN "figures" ON "figures"."dance_style_id" = "dance_styles"."id" JOIN student_progresses sp ON sp.figure_id = figures.id WHERE (sp.user_id = $1) ORDER BY "dance_styles"."name" ASC  [[nil, 4]]
SELECT "figures".* FROM "figures" WHERE "figures"."id" IN ($1, $2, $3, $4)  [["id", 1], ["id", 4], ["id", 2], ["id", 3]]
SELECT "student_progresses".* FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1 ORDER BY dance_styles.name, dance_levels.level_number, figures.figure_number  [["user_id", 4]]
SELECT "student_progresses".* FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1 AND "figures"."dance_style_id" = $2 ORDER BY dance_styles.name, dance_levels.level_number, figures.figure_number  [["user_id", 4], ["dance_style_id", 2]]
SELECT "dance_levels".* FROM "dance_levels" WHERE "dance_levels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "dance_styles" INNER JOIN "figures" ON "figures"."dance_style_id" = "dance_styles"."id" JOIN student_progresses sp ON sp.figure_id = figures.id WHERE (sp.user_id = $1) LIMIT $2  [[nil, 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT "dance_styles".* FROM "dance_styles" WHERE "dance_styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 3], ["id", 2]]

    @student_progresses_paginated = filtered_progresses.page(params[:page]).per(20)

    # Group by dance style for better organization (only for current page)
    @progresses_by_style = @student_progresses_paginated.group_by { |sp| sp.figure.dance_style }
---
SELECT "dance_styles".* FROM "dance_styles"
SELECT "figures".* FROM "figures" WHERE "figures"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]

  def all_students
    authorize_instructor_access!

    @users_with_progress = User.students
                               .joins(:student_progresses)
                               .includes(student_progresses: [{ figure: [:dance_style, :dance_level] }, :instructor])
                               .distinct
                               .order(:last_name, :first_name)

    # Calculate progress stats for each user
    @progress_stats = {}
    @users_with_progress.each do |user|
      total = user.student_progresses.count
      completed = user.student_progresses.completed.count
---
SELECT "dance_styles".* FROM "dance_styles" WHERE "dance_styles"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1  [["user_id", 5]]
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."user_id" = $1  [["user_id", 5]]
SELECT COUNT(*) FROM "student_progresses" WHERE "student_progresses"."user_id" = $1  [["user_id", 4]]

  def update
    authorize_edit_access!

    # Handle mark_all parameter from JavaScript
    if params[:mark_all] == 'true'
      @student_progress.update!(
        movement_passed: true,
        timing_passed: true,
        partnering_passed: true
      )
---
UPDATE "student_progresses" SET "partnering_passed" = $1, "updated_at" = $2 WHERE "student_progresses"."id" = $3  [["partnering_passed", true], ["updated_at", "2025-07-28 03:36:21.767713"], ["id", 5]]

  def mark_progress
    authorize_edit_access!

    # Handle GET request - show the mark progress form
    if request.get?
      @figure = @student_progress.figure
      @dance_style = @figure.dance_style
      @dance_level = @figure.dance_level
      @instructor = @student_progress.instructor
      return
    end

    # Handle PATCH request - update progress
    component = params[:component]

    case component
    when 'movement'
      @student_progress.toggle!(:movement_passed)
    when 'timing'
      @student_progress.toggle!(:timing_passed)
    when 'partnering'
      @student_progress.toggle!(:partnering_passed)
    when 'reset'
      @student_progress.update!(
        movement_passed: false,
        timing_passed: false,
        partnering_passed: false,
        completed_at: nil
      )
---
UPDATE "student_progresses" SET "partnering_passed" = $1, "updated_at" = $2 WHERE "student_progresses"."id" = $3  [["partnering_passed", true], ["updated_at", "2025-07-28 04:10:03.154569"], ["id", 9]]
UPDATE "student_progresses" SET "movement_passed" = $1, "updated_at" = $2 WHERE "student_progresses"."id" = $3  [["movement_passed", true], ["updated_at", "2025-07-28 05:36:58.722735"], ["id", 24]]

  def enroll
    authorize_instructor_access!

    if params[:user_id].present?
      @student = User.find(params[:user_id])
    else
      redirect_to users_path, alert: "Please select a student to enroll." and return
    end

    @dance_styles = DanceStyle.all.order(:name)
    @dance_levels = DanceLevel.all.order(:level_number)

    if request.post?
      dance_style = DanceStyle.find(params[:dance_style_id])
      dance_level = DanceLevel.find(params[:dance_level_id])

      # Find all figures for this style and level
      figures = Figure.where(dance_style: dance_style, dance_level: dance_level)

      if figures.empty?
        flash[:warning] = "No figures found for #{dance_style.name} #{dance_level.name}"
        return
      end

      # Create progress records for figures that don't already exist
      created_count = 0
      figures.each do |figure|
        unless @student.student_progresses.exists?(figure: figure)
          @student.student_progresses.create!(
            figure: figure,
            instructor: current_user,
            movement_passed: false,
            timing_passed: false,
            partnering_passed: false,
            notes: "Enrolled in #{dance_style.name} #{dance_level.name}"
          )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "dance_styles".* FROM "dance_styles" ORDER BY "dance_styles"."name" ASC
SELECT "dance_levels".* FROM "dance_levels" ORDER BY "dance_levels"."level_number" ASC
SELECT "dance_styles".* FROM "dance_styles" WHERE "dance_styles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "dance_levels".* FROM "dance_levels" WHERE "dance_levels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "figures".* FROM "figures" WHERE "figures"."dance_style_id" = $1 AND "figures"."dance_level_id" = $2  [["dance_style_id", 2], ["dance_level_id", 1]]
SELECT 1 AS one FROM "figures" WHERE "figures"."dance_style_id" = $1 AND "figures"."dance_level_id" = $2 LIMIT $3  [["dance_style_id", 2], ["dance_level_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 AND "student_progresses"."figure_id" = $2 LIMIT $3  [["user_id", 4], ["figure_id", 34], ["LIMIT", 1]]
INSERT INTO "student_progresses" ("user_id", "figure_id", "movement_passed", "timing_passed", "partnering_passed", "completed_at", "instructor_id", "created_at", "updated_at", "notes") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def set_user
    @user = params[:user_id].present? ? User.find(params[:user_id]) : current_user
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def set_student_progress
    if params[:user_id].present?
      # Admin/instructor accessing specific user's progress
      authorize_instructor_access!
      @student_progress = @user.student_progresses.find(params[:id])
    else
      # User accessing their own progress
      @student_progress = current_user.student_progresses.find(params[:id])
---
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 AND "student_progresses"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 7], ["LIMIT", 1]]
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 AND "student_progresses"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 24], ["LIMIT", 1]]