app/controllers/users_controller.rb

  def index
    @users = User.includes(:student_progresses, :bookings, :private_lessons_as_student)

    # Apply filters
    if filter_params[:role].present?
      @users = @users.where(role: filter_params[:role])
    end

    if filter_params[:search].present?
      search_term = "%#{filter_params[:search]}%"
      @users = @users.where(
        "first_name ILIKE ? OR last_name ILIKE ? OR email ILIKE ?",
        search_term, search_term, search_term
      )
    end

    @users = @users.order(:last_name, :first_name)
                   .page(filter_params[:page])
                   .per(20)
---
SELECT COUNT(*) FROM "users" WHERE "users"."role" = $1  [["role", "student"]]