app/controllers/users_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["user_id", 4], ["user_id", 5], ["user_id", 6], ["user_id", 7], ["user_id", 8], ["user_id", 2], ["user_id", 3], ["user_id", 1]]
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["user_id", 4], ["user_id", 5], ["user_id", 6], ["user_id", 7], ["user_id", 8], ["user_id", 2], ["user_id", 3], ["user_id", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."role" = $1 AND (first_name ILIKE $2 OR last_name ILIKE $3 OR email ILIKE $4) LIMIT $5  [["role", "admin"], [nil, "%adam.s.hanna@gmail.com%"], [nil, "%adam.s.hanna@gmail.com%"], [nil, "%adam.s.hanna@gmail.com%"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1 AND (first_name ILIKE $2 OR last_name ILIKE $3 OR email ILIKE $4) ORDER BY "users"."last_name" ASC, "users"."first_name" ASC  [["role", "student"], [nil, "%wolk%"], [nil, "%wolk%"], [nil, "%wolk%"]]
SELECT "users".* FROM "users" ORDER BY "users"."last_name" ASC, "users"."first_name" ASC
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.includes(:student_progresses, :bookings, :private_lessons_as_student)

    # Filter by role if specified
    @users = @users.where(role: params[:role]) if params[:role].present?

    # Search functionality
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @users = @users.where(
        "first_name ILIKE ? OR last_name ILIKE ? OR email ILIKE ?",
        search_term, search_term, search_term
      )
    end

    @users = @users.order(:last_name, :first_name)

    # Statistics for admin view
    @total_users = User.count

SELECT "figures".* FROM "figures" WHERE "figures"."id" IN ($1, $2, $3, $4)  [["id", 4], ["id", 1], ["id", 3], ["id", 2]]
SELECT "student_progresses".* FROM "student_progresses" WHERE "student_progresses"."user_id" = $1 ORDER BY "student_progresses"."updated_at" DESC LIMIT $2  [["user_id", 4], ["LIMIT", 5]]
---
  def show
    @recent_progress = @user.student_progresses.includes(:figure)
                           .order(updated_at: :desc).limit(5) if @user.student?

SELECT COUNT(DISTINCT "student_progresses"."id") FROM "student_progresses" INNER JOIN "figures" ON "figures"."id" = "student_progresses"."figure_id" INNER JOIN "dance_styles" ON "dance_styles"."id" = "figures"."dance_style_id" INNER JOIN "dance_levels" ON "dance_levels"."id" = "figures"."dance_level_id" WHERE "student_progresses"."user_id" = $1 AND NOT ("student_progresses"."movement_passed" = $2 AND "student_progresses"."timing_passed" = $3 AND "student_progresses"."partnering_passed" = $4) AND "student_progresses"."completed_at" IS NULL  [["user_id", 4], ["movement_passed", false], ["timing_passed", false], ["partnering_passed", false]]
---
  def progress_report
    # Generate a detailed progress report for the user
    unless current_user.admin? || current_user.instructor? || current_user == @user
      flash[:error] = "You are not authorized to view this progress report."
      redirect_to root_path
      return
    end

    @progress_data = @user.student_progresses.includes(figure: [:dance_style, :dance_level])
                          .joins(figure: [:dance_style, :dance_level])
                          .order('dance_styles.name, dance_levels.level_number, figures.figure_number')

    @progress_by_style = @progress_data.group_by { |sp| sp.figure.dance_style }

    @overall_stats = {
      total_figures: @progress_data.count,
      completed_figures: @progress_data.completed.count,
      in_progress: @progress_data.where.not(movement_passed: false, timing_passed: false, partnering_passed: false)
                                .where(completed_at: nil).count